[
  {
    "title": "¿Qué objetivo tiene este compendio de reglas?",
    "short_answer": "Este documento reúne dudas frecuentes y ofrece respuestas apoyadas en las reglas oficiales de Riftbound.",
    "detail_section": {
      "type": "text",
      "text": "La idea es mantener un repositorio vivo de respuestas rápidas respaldadas por el reglamento de *Riftbound*. Si encuentras un caso que no esté cubierto, coméntalo en el grupo de jueces o en el chat de dudas de la comunidad **Riftbound Chile** en WhatsApp para incorporarlo en futuras actualizaciones."
    }
  },
  {
    "title": "¿Cómo funciona Icathian Rain?",
    "short_answer": "Juegas *Icathian Rain* sin objetivos, y al resolverse crea seis disparos reflexivos que luego deben elegir objetivo y hacer 2 de daño cada uno.",
    "detail_section": [
      {
        "type": "text",
        "text": "*Icathian Rain* se lanza desde tu mano sin seleccionar objetivos iniciales y pasa a la cadena, donde ambos jugadores aún pueden reaccionar. Cuando el hechizo se resuelve, se añaden seis ítems a la cadena —cada uno selecciona una unidad y le hace 2 de daño al resolverse. Es posible reaccionar antes de que aparezcan estos disparos reflexivos y también entre cada uno de ellos, pero no después del último."
      },
      {
        "type": "card_image",
        "cards": [
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-248.webp",
            "text": "**Icathian Rain** — *Do this 6 times: Deal 2 to a unit. (You can choose different units.)*"
          },
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-104.webp",
            "text": "**Retreat** — *<reaction> (Play any time, even before spells and abilities resolve.) Return a friendly unit to its owner's hand. Its owner channels 1 rune exhausted.*"
          }
        ]
      },
      {
        "type": "text",
        "text": "Al indicar “Do this 6 times”, el hechizo crea seis *Reflexive Triggers*, cada uno con el texto “Deal 2 to a unit”. Debes elegir objetivo para cada disparo: si usas o apuntas a una unidad con **<deflect>**, debes pagar el costo por cada uno de los disparos que la seleccionen. Si el oponente retira una unidad con *Retreat* antes de que se resuelva *Icathian Rain*, deberás elegir entre las unidades restantes, incluso las tuyas (puedes seleccionar la misma unidad más de una vez)."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "379",
            "text": "Reflexive Triggers"
          },
          {
            "number": "380",
            "text": "Reflexive Triggers are a type of Triggered Ability that create one or more Chain Items when their condition is met."
          },
          {
            "number": "380.1",
            "text": "Reflexive Triggers can be recognized by the phrase “Do this:” or “Do one of the following:”."
          },
          {
            "number": "380.1.a",
            "text": "“Do this” can be followed by “N times.” The Reflexive Trigger will thus be added to the chain N times when its condition is met."
          },
          {
            "number": "380.2",
            "text": "Reflexive Triggers will be preceded by their conditions, if any. If no condition is present in the ability then the Reflexive Trigger will always be added to the Chain."
          },
          {
            "number": "380.3",
            "text": "If present, the Condition of a Reflexive Trigger will follow the same format as a Triggered Ability."
          },
          {
            "number": "381",
            "text": "Reflexive Triggers use the Chain."
          },
          {
            "number": "381.1",
            "text": "A new ability is created and added to the chain as a Pending Item.\nSee rule 386. Playing or Activating Abilities for more information."
          },
          {
            "number": "381.2",
            "text": "If a Reflexive Trigger creates more than one Pending Item it creates them all in order, but does not go beyond the first step of adding them to the Chain.\nSee rule 386. Playing or Activating Abilities for more information."
          }
        ]
      }
    ]
  },
  {
    "title": "¿Puedo reaccionar cuando una unidad <temporary> va a morir?",
    "short_answer": "Sí. <temporary> es una habilidad disparada, así que puedes responder antes de que la unidad salga del campo.",
    "detail_section": [
      {
        "type": "text",
        "text": "La palabra clave <temporary> representa un *trigger*. Cuando empieza la Fase de Comienzo de su controlador, la habilidad se agrega a la cadena y, si llega a resolverse, destruye la unidad. Mientras ese disparo esté pendiente, todavía hay ventanas para reaccionar."
      },
      {
        "type": "card_image",
        "cards": [
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-241.webp",
            "text": "**Shen** — *<reaction> (Play any time, even before spells and abilities resolve, including to a battlefield you control.) <shield 2> (+2 might while I'm a defender.) <tank> (I must be assigned combat damage first.)*"
          },
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-169.webp",
            "text": "**Gust** — *<reaction> (Play any time, even before spells and abilities resolve.) Return a unit at a battlefield with 3 might or less to its owner's hand.*"
          }
        ]
      },
      {
        "type": "text",
        "text": "Como el trigger de <temporary> ocurre antes de puntuar, puedes reaccionar con **Shen** para que entre al battlefield donde está tu unidad con <temporary>: el permanente no muere hasta que la habilidad se resuelva, así que conservas el control mientras esperas. Del mismo modo, si hay otra unidad con 3 o menos de Might, puedes responder con *Gust* y devolverla a la mano de tu oponente para impedir que anote por *hold*."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "742",
            "text": "Temporary"
          },
          {
            "number": "742.1",
            "text": "Temporary is a Triggered Ability keyword."
          },
          {
            "number": "742.1.a",
            "text": "It is present on Permanents."
          },
          {
            "number": "742.1.b",
            "text": "It is functionally short for \"At the start of this permanent's controller's Beginning Phase, before scoring, kill this.\""
          },
          {
            "number": "742.1.c",
            "text": "The Trigger Condition is the controller of the permanent's Beginning Phase occurring."
          }
        ]
      }
    ]
  }
]
