[
  {
    "title": "¿Qué objetivo tiene este compendio de reglas?",
    "short_answer": "**Este documento** reúne dudas frecuentes y ofrece respuestas apoyadas en las reglas oficiales de Riftbound.",
    "detail_section": {
      "type": "text",
      "text": "**Este compendio no es un documento oficial**; fue creado por la comunidad para facilitar la comprensión de las reglas y, en juego organizado, **la última palabra siempre la tendrá la jueza o el juez a cargo del evento**. La idea es mantener un repositorio vivo de respuestas rápidas respaldadas por el reglamento de ***Riftbound***. Si encuentras un caso que no esté cubierto, coméntalo en el grupo de jueces o en el chat de dudas de la comunidad **Riftbound Chile** en WhatsApp para incorporarlo en futuras actualizaciones."
    }
  },
  {
    "title": "¿Cómo funciona Icathian Rain?",
    "short_answer": "Juegas ***Icathian Rain*** sin objetivos y, al resolverse, crea **seis disparos reflexivos** que luego deben elegir objetivo y hacer 2 de daño cada uno.",
    "detail_section": [
      {
        "type": "text",
        "text": "***Icathian Rain*** se lanza desde tu mano sin seleccionar objetivos iniciales y pasa a la cadena, donde **ambos jugadores aún pueden reaccionar**. Cuando el hechizo se resuelve, se añaden **seis ítems a la cadena** —cada uno selecciona una unidad y le hace 2 de daño al resolverse. Es posible reaccionar antes de que aparezcan estos disparos reflexivos y también entre cada uno de ellos, pero no después del último."
      },
      {
        "type": "card_image",
        "cards": [
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-248.webp",
            "text": "**Icathian Rain** — *Do this 6 times: Deal 2 to a unit. (You can choose different units.)*"
          },
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-104.webp",
            "text": "**Retreat** — *<reaction> (Play any time, even before spells and abilities resolve.) Return a friendly unit to its owner's hand. Its owner channels 1 rune exhausted.*"
          }
        ]
      },
      {
        "type": "text",
        "text": "Al indicar **“Do this 6 times”**, el hechizo crea **seis *Reflexive Triggers***, cada uno con el texto “Deal 2 to a unit”. Debes elegir objetivo para cada disparo: si usas o apuntas a una unidad con **<deflect>**, debes pagar el costo por cada uno de los disparos que la seleccionen. Si el oponente retira una unidad con ***Retreat*** antes de que se resuelva ***Icathian Rain***, deberás elegir entre las unidades restantes, incluso las tuyas (puedes seleccionar la misma unidad más de una vez)."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "379",
            "text": "Reflexive Triggers"
          },
          {
            "number": "380",
            "text": "Reflexive Triggers are a type of Triggered Ability that create one or more Chain Items when their condition is met."
          },
          {
            "number": "380.1",
            "text": "Reflexive Triggers can be recognized by the phrase “Do this:” or “Do one of the following:”."
          },
          {
            "number": "380.1.a",
            "text": "“Do this” can be followed by “N times.” The Reflexive Trigger will thus be added to the chain N times when its condition is met."
          },
          {
            "number": "380.2",
            "text": "Reflexive Triggers will be preceded by their conditions, if any. If no condition is present in the ability then the Reflexive Trigger will always be added to the Chain."
          },
          {
            "number": "380.3",
            "text": "If present, the Condition of a Reflexive Trigger will follow the same format as a Triggered Ability."
          },
          {
            "number": "381",
            "text": "Reflexive Triggers use the Chain."
          },
          {
            "number": "381.1",
            "text": "A new ability is created and added to the chain as a Pending Item.\nSee rule 386. Playing or Activating Abilities for more information."
          },
          {
            "number": "381.2",
            "text": "If a Reflexive Trigger creates more than one Pending Item it creates them all in order, but does not go beyond the first step of adding them to the Chain.\nSee rule 386. Playing or Activating Abilities for more information."
          }
        ]
      }
    ]
  },
  {
    "title": "¿Puedo reaccionar cuando una unidad <temporary> va a morir?",
    "short_answer": "Sí. <temporary> es una **habilidad disparada**, así que puedes responder antes de que la unidad salga del campo.",
    "detail_section": [
      {
        "type": "text",
        "text": "La palabra clave <temporary> representa un **trigger**. Cuando empieza la **Fase de Comienzo** de su controlador, la habilidad se agrega a la cadena y, si llega a resolverse, destruye la unidad. Mientras ese disparo esté pendiente, todavía hay ventanas para reaccionar."
      },
      {
        "type": "card_image",
        "cards": [
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-241.webp",
            "text": "**Shen** — *<reaction> (Play any time, even before spells and abilities resolve, including to a battlefield you control.) <shield 2> (+2 might while I'm a defender.) <tank> (I must be assigned combat damage first.)*"
          },
          {
            "url": "https://static.dotgg.gg/riftbound/cards/OGN-169.webp",
            "text": "**Gust** — *<reaction> (Play any time, even before spells and abilities resolve.) Return a unit at a battlefield with 3 might or less to its owner's hand.*"
          }
        ]
      },
      {
        "type": "text",
        "text": "Como el trigger de <temporary> ocurre **antes de puntuar**, puedes reaccionar con **Shen** para que entre al battlefield donde está tu unidad con <temporary>: el permanente no muere hasta que la habilidad se resuelva, así que conservas el control mientras esperas. Del mismo modo, si hay otra unidad con 3 o menos de Might, puedes responder con ***Gust*** y devolverla a la mano de tu oponente para impedir que anote por *hold*."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "742",
            "text": "Temporary"
          },
          {
            "number": "742.1",
            "text": "Temporary is a Triggered Ability keyword."
          },
          {
            "number": "742.1.a",
            "text": "It is present on Permanents."
          },
          {
            "number": "742.1.b",
            "text": "It is functionally short for \"At the start of this permanent's controller's Beginning Phase, before scoring, kill this.\""
          },
          {
            "number": "742.1.c",
            "text": "The Trigger Condition is the controller of the permanent's Beginning Phase occurring."
          }
        ]
      }
    ]
  },
  {
    "title": "¿Qué pasa si olvido un trigger?",
    "short_answer": "Si fue en el turno actual, **el siguiente jugador decide** si te deja resolverlo; aun así el juego cuenta el trigger y puede implicar un warning.",
    "detail_section": [
      {
        "type": "text",
        "text": "**Para que un trigger olvidado pueda resolverse tarde**, debes detectarlo antes de que termine el mismo turno en que ocurrió. En ese caso, **el siguiente jugador en el orden de turnos elige** si permite que se resuelva inmediatamente o si continúa sin él. Si el trigger todavía no ha afectado al juego, la decisión final sobre permitirlo recae en la jueza o el juez responsable."
      },
      {
        "type": "text",
        "text": "Si el trigger beneficiaba a tu oponente, omitirlo te deja con un **[Warning]**. En torneos casuales se anima a los jugadores a permitir la resolución atrasada, pero en eventos *High OPL* no existe esa obligación."
      },
      {
        "type": "text",
        "text": "Incluso cuando el trigger no se ejecuta, el juego lo considera como si hubiese ocurrido para otros efectos que cuenten la cantidad de veces que se dispara o que chequeen si el trigger ya se ha disparado antes. Los triggers olvidados se clasifican como **missed triggers**, un subtipo de *Gameplay Error*."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "702.2",
            "text": "Missed Trigger [No Penalty]: A player controls a triggered ability and doesn’t demonstrate awareness of the trigger before the first time it would affect the game in a visible fashion."
          },
          {
            "number": "702.2.a",
            "text": "See 506 for definition of triggered abilities."
          },
          {
            "number": "702.2.b",
            "text": "After the initial point at which a triggered ability is missed, any further errors related to that trigger are considered a General Error instead. See 702.15 for more information about General Errors."
          },
          {
            "number": "702.2.c",
            "text": "Players may not cause triggered abilities controlled by an opponent to be missed by taking game actions or otherwise prematurely advancing the game, including through otherwise acceptable shortcuts."
          },
          {
            "number": "702.2.d",
            "text": "A triggered ability is considered to have triggered even if it was subsequently missed. Effects that count or restrict the number of times that ability can trigger will count the missed one."
          },
          {
            "number": "702.2.e",
            "text": "If missing the trigger was advantageous for the controller, and they own the card source of the trigger, this penalty is a [Warning] instead."
          },
          {
            "number": "702.2.f",
            "text": "Remedies."
          },
          {
            "number": "702.2.f.1",
            "text": "If a trigger is missed in a previous turn, instruct the players to continue playing."
          },
          {
            "number": "702.2.f.2",
            "text": "Otherwise, the next opponent in turn order of the player who missed the trigger chooses whether to resolve the trigger immediately or miss it altogether."
          }
        ]
      }
    ]
  },
  {
    "title": "¿Puedo jugar una carta <action> y luego una <reaction>?",
    "short_answer": "Sí. Tras poner la carta <action> en la cadena puedes **mantener prioridad** y, en la ejecución, añadir tu <reaction> antes de que el oponente responda.",
    "detail_section": [
      {
        "type": "text",
        "text": "Cuando juegas una carta <action>, la cadena está vacía y tú controlas el nuevo ítem, por lo que **eres la persona activa**. Si declaras que mantienes prioridad, procedes directamente al Paso 2 antes de que tu oponente reciba la suya. Aunque el paso se llame **“Finalize”**, es el primero que se ejecuta y es donde el ítem pasa de **pendiente a finalizado**."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "333",
            "text": "Step 1: Finalize"
          },
          {
            "number": "333.1",
            "text": "If one or more Items are Pending, their controllers must complete the steps of Playing those Pending Items until they are Finalized Items or leave the Chain."
          },
          {
            "number": "333.1.a",
            "text": "This process does not pass Priority."
          },
          {
            "number": "333.1.b",
            "text": "Each Item is Finalized in the order it was appended to the Chain."
          },
          {
            "number": "333.1.c",
            "text": "Abilities that Add resources, Units, and Gear resolve immediately when Finalized and do not progress to Step 2: Execute. See rule 346. Playing Cards for more information."
          },
          {
            "number": "333.1.c.1",
            "text": "If the Chain is empty, play proceeds in an Open State."
          },
          {
            "number": "333.1.c.2",
            "text": "If the Chain is not empty and there are one or more Pending Items, repeat Step 1."
          },
          {
            "number": "333.1.c.3",
            "text": "If the Chain is not empty and there are no Pending Items, the controller of the newest item on the chain gains Priority and becomes the Active Player. Proceed to Step 2: Execute."
          }
        ]
      },
      {
        "type": "text",
        "text": "Con la <action> finalizada y tú como jugador activo, el Paso 2 te permite jugar cualquier carta legal para ese momento. El nombre **“Execute” no significa que el spell se resuelva ahí**; significa que la persona activa ejecuta una acción antes de que se resuelva el ítem más reciente. Como la cadena sigue abierta, las únicas cartas legales adicionales son las que tengan <reaction>."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "334",
            "text": "Step 2: Execute"
          },
          {
            "number": "334.1",
            "text": "The Active Player may do any the following:"
          },
          {
            "number": "334.1.a",
            "text": "Play a Card that is legally timed."
          },
          {
            "number": "334.1.a.1",
            "text": "Cards, by default, cannot be played during a Closed State."
          },
          {
            "number": "334.1.a.2",
            "text": "A Legally Timed Card would be a Card with Reaction."
          },
          {
            "number": "334.1.a.3",
            "text": "Other exceptions may be created during regular play."
          },
          {
            "number": "334.1.a.4",
            "text": "The card will be added to the chain as a Pending Item, following the steps of playing a card."
          },
          {
            "number": "334.1.a.5",
            "text": "This can be an additional card to the item that Started the Chain in the case of the first Active Player after creating the Chain."
          },
          {
            "number": "334.1.a.6",
            "text": "Whether a Card is legally timed is evaluated during the “Check Legality” step of Playing a Card. See rule 346. Playing Cards for more information."
          },
          {
            "number": "334.1.a.7",
            "text": "Playing a card will create one or more Pending Items. Return to Step 1: Finalize."
          },
          {
            "number": "334.1.b",
            "text": "Activate Abilities of Game Objects that are legally timed. See rule 386. Playing or Activating Abilities for more information."
          },
          {
            "number": "334.1.b.1",
            "text": "All rules for legally timed cards apply to legally timed abilities."
          },
          {
            "number": "334.1.b.2",
            "text": "Activating abilities will create one or more Pending Items. Return to Step 1: Finalize."
          },
          {
            "number": "334.1.c",
            "text": "Pass Priority"
          },
          {
            "number": "334.1.c.1",
            "text": "The Active Player passes Priority to the next Player in Turn Order. Proceed to Step 3: Pass."
          }
        ]
      },
      {
        "type": "text",
        "text": "Una vez que agregas tu <reaction>, el juego regresa al Paso 1 para finalizarla, y la prioridad vuelve a estar de tu lado. Puedes seguir **manteniéndola hasta decidir pasar**."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "335",
            "text": "Step 3: Pass"
          },
          {
            "number": "335.1",
            "text": "If all players have passed Priority without adding any items to the Chain, proceed to Step 4: Resolve."
          },
          {
            "number": "335.2",
            "text": "Otherwise, the Active Player passes Priority to the next Player in Turn Order. Return to Step 2: Execute."
          }
        ]
      },
      {
        "type": "text",
        "text": "Después de que pases por primera vez, **tu oponente recibe su oportunidad en el Paso 2** y recién entonces puede responder con su propia <reaction>."
      }
    ]
  },
  {
    "title": "¿Puedo reaccionar a la mitad de una cadena?",
    "short_answer": "Sí. Cada vez que un ítem se resuelve, **el controlador del siguiente ítem recibe prioridad** y puede jugar una <reaction> antes de continuar.",
    "detail_section": [
      {
        "type": "text",
        "text": "Cuando un ítem termina de resolverse, la cadena puede quedar con más elementos. En ese caso, la persona que controla el ítem más reciente obtiene **prioridad** y vuelve al Paso 2, con la opción de jugar reacciones antes de que el juego avance."
      },
      {
        "type": "rule_reference",
        "rules": [
          {
            "number": "336",
            "text": "Step 4: Resolve"
          },
          {
            "number": "336.1",
            "text": "The newest item on the Chain resolves. Execute its game effects in their entirety. See rule 346. Playing Cards for more information on resolving spells. See rule 386. Playing or Activating Abilities for more information on resolving abilities."
          },
          {
            "number": "336.2",
            "text": "If the Chain is empty, play proceeds in an Open State."
          },
          {
            "number": "336.3",
            "text": "If the Chain is not empty and there are one or more Pending Items, return to Step 1: Finalize."
          },
          {
            "number": "336.4",
            "text": "If the Chain is not empty and there are no Pending Items, the controller of the newest item on the chain gains Priority and becomes the Active Player. Return to Step 2: Execute."
          }
        ]
      },
      {
        "type": "text",
        "text": "Este bucle de **Finalizar, Ejecutar y Pasar** se repite mientras existan ítems pendientes, así que cada resolución abre una nueva ventana para jugar <reaction> o activar habilidades de tiempo legal antes de que la cadena continúe."
      }
    ]
  }
]
